       identification division.
       program-id. TempConverter.

       environment division.

       data division.

       procedure division.
       000-main.
           display ' '.
           display "Welcome to temperature converter".
           display ' '.
           display 'Enter a fahrenheit temperature to convert to celsius...'.
           stop run.
