000100 identification division.
000200 program-id. HelloWorld.
000300 
000400 environment division.
000600 
000700 data division.
000800 
000900 procedure division.
001000 000-main.
001100	display "Hello, World!".
001200	stop run.
