       identification division.
       program-id. HelloWorld.
       
       environment division.
       
       data division.
       
       procedure division.
       000-main.
      	display "Hello, World!".
      	stop run.
