       *> Assignment 1 - BIS 4523 COBOL
       identification division.
       program-id. HelloWorld.
       author. WyattShanahan.   
       environment division.
	   
       data division.
       
       procedure division.
       000-main.
           display "Hello, World!".
      	   stop run.
